// Задача получить от пользователя 2 числа и вывести в диалоговое око сумму значений,
// которые ввел пользователь,вывод должен выглядеть так(примерно)
// Результат сложения числа 5 и 2 равен 7



// const num1 =  parseFloat(prompt("Введите первое число"));
// const num2 =  +prompt(("Введите второе число"));



// const num1 =  parseInt(prompt("Введите первое число"));
// const num2 =  parseInt(prompt("Введите второе число"));
// alert(`Результат сложения чисел ${num1} и ${num2} равен ${num1 + num2}`);

// function summa(n1,n2) {
    // return n1 + n2 ;    
// }

// alert(`Результат сложения чисел ${num1} и ${num2} равен ${summa(num1,num2)}`);
   
// Задача 2 вывести на экран в диалоговом окне текст  " Вам хорохо живется"
// и кнопку ок , отмена, для чего нужне CONFIRM. 
// при ажатии ок = " Тогда мы идем к вам"
// при нажатии отмена = "Ну, вы  выдержитесь там "

// const userAgree = confirm("Вы хорохо живете?");

// if (userAgree){             // (userAgree == true)
    // alert("Тогда мы идем к вам!");
// } else { 
    // alert("Ну, вы держитесь там!");
// }


// Задача 3 перепиши код ,использую конструкцию swich-case,                                 запрашивая продукт через диологовое окно











